# centernet mobilenetV2 track

model {
  center_net {
    num_classes: 1
    feature_extractor {
      type: "mobilenet_v2"
    }
    image_resizer {
      fixed_shape_resizer {
        height: 384
        width: 384
      }
    }
    use_depthwise: true
    object_detection_task {
      task_loss_weight: 1.0
      offset_loss_weight: 1.0
      scale_loss_weight: 0.1
      localization_loss {
        l1_localization_loss {
        }
      }
    }
    object_center_params {
      object_center_loss_weight: 1.0
      min_box_overlap_iou: 0.7
      peak_max_pool_kernel_size: 1
      max_box_predictions: 10
      classification_loss {
        penalty_reduced_logistic_focal_loss {
          alpha: 2.0
          beta: 4.0
        }
      }
    }
    track_estimation_task {
      task_loss_weight: 1
      num_track_ids: 50
      reid_embed_size: 8
      num_fc_layers: 2
      classification_loss {
        weighted_sigmoid{}
      }
  }
  }
}
train_config {
  batch_size: 32
  num_steps: 250000
  data_augmentation_options {
    random_crop_image {
      min_aspect_ratio: 0.9
      max_aspect_ratio: 1.1
      random_coef: 0.25
    }
  }
  data_augmentation_options {
    random_absolute_pad_image {
       max_height_padding: 200
       max_width_padding: 200
       pad_color: [0, 0, 0]
    }
  }
  data_augmentation_options{
    random_rotation90 {
    }
  }
  data_augmentation_options {
    random_distort_color {
    }
  }
  data_augmentation_options {
    random_image_scale {
    }
  }


  optimizer {
    adam_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: .001
          schedule {
            step: 30000
            learning_rate: .0005
          }
          schedule {
            step: 60000
            learning_rate: .0002
          }
          schedule {
            step: 120000
            learning_rate: .0001
          }
          schedule {
            step: 240000
            learning_rate: .00005
          }
        }
      }
    }
    use_moving_average: false
  }
  max_number_of_boxes: 10
  unpad_groundtruth_tensors: false
}
train_input_reader {
  load_track_id : true
  label_map_path: "/workspace/dataset/caltech/caltech_labelmap.pbtxt"
  tf_record_input_reader {
    input_path: "/workspace/dataset/caltech/train.tfrecord"
  }
}
eval_config {
  metrics_set: "pascal_voc_detection_metrics"
  max_num_boxes_to_visualize:10
  batch_size: 8
  save_graph: true
  visualization_export_dir: "/workspace/MultiObjTracking/output/evalImgs"
  keep_image_id_for_visualization_export: true
  eval_interval_secs: 3
}
eval_input_reader {
  load_track_id : true
  label_map_path: "/workspace/dataset/caltech/caltech_labelmap.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "/workspace/dataset/caltech/val.tfrecord"
  }
}
